export const SERVICE_TEXT = {
  title: "밀모리 서비스 이용약관",
  step: [
    {
      subTitle: "제1조 목적",
      content: [
        {
          value:
            '본 약관은 밀모리(이하 "본 서비스")의 이용과 관련하여, 본 서비스를 제공하는 운영자(이하 "운영자")와 이용자 간의 권리, 의무 및 책임사항, 기타 필요한 사항을 규정함을 목적으로 합니다.',
        },
      ],
    },
    {
      subTitle: "제2조 정의",
      content: [
        {
          value: `"본 서비스"란 운영자가 제공하는 식단 기록 및 관리 서비스를 의미합니다.`,
        },
        {
          value: `"이용자"란 본 서비스에 접속하여 이 약관에 따라 본 서비스가 제공하는 서비스를 받는 회원을 의미합니다.`,
        },
        {
          value: `"회원"이란 본 서비스에 개인정보를 제공하여 회원등록을 한 자로서, 본 서비스의 정보를 지속적으로 제공받으며 본 서비스가 제공하는 각종 서비스를 이용할 수 있는 자를 의미합니다.`,
        },
      ],
    },
    {
      subTitle: "제3조 약관의 게시와 개정",
      content: [
        {
          value:
            "운영자는 본 약관의 내용을 이용자가 쉽게 알 수 있도록 본 서비스의 서비스 정보 화면에 게시합니다.",
        },
        {
          value: `운영자는 약관의 규제에 관한 법률, 정보통신망 이용촉진 및 정보보호 등에 관한 법률 등 관련법을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.`,
        },
        {
          value: `운영자는 약관을 개정할 경우 적용 일자 및 개정 사유를 명시하여 현행 약관과 함께 본 서비스 공지사항에 공지합니다.`,
        },
        {
          value: `이용자는 개정된 약관에 동의하지 않을 권리가 있으며, 개정된 약관에 동의하지 않을 경우 본 서비스의 이용을 중단하고 회원 탈퇴를 할 수 있습니다.`,
        },
      ],
    },
    {
      subTitle: "제4조 회원 가입 및 이용 계약의 성립",
      content: [
        {
          value: `이용자는 운영자가 정한 절차에 따라 회원 가입 신청을 하고, 운영자가 이를 승낙함으로써 이용 계약이 성립됩니다.`,
        },
        {
          value: `운영자는 다음 각 호에 해당하는 신청에 대해서는 승낙하지 않을 수 있습니다`,
          children: [
            { value: `실명이 아닌 명의 또는 타인의 명의를 이용한 경우` },
            {
              value: `허위 정보를 기재하거나, 운영자가 요구하는 내용을 기재하지 않은 경우`,
            },
            {
              value: `기타 회원으로 등록하는 것이 본 서비스의 기술상 현저히 지장이 있다고 판단되는 경우`,
            },
          ],
        },
      ],
    },
    {
      subTitle: "제5조 서비스의 제공 및 변경",
      content: [
        { value: `본 서비스는 무료로 제공됩니다.` },
        {
          value: `운영자는 서비스의 내용 및 제공 방식을 변경할 수 있으며, 이 경우 변경 내용 및 일자를 명시하여 사전에 공지합니다.`,
        },
        {
          value: `운영자는 서비스 배포의 목적 "취업"의 달성 시 서비스의 제공을 중단할 수 있으며, 이 경우 중단 일자를 명시하여 최소 14일 이전에 공지합니다.`,
        },
      ],
    },
    {
      subTitle: "제6조 개인정보 보호",
      content: [
        {
          value: `운영자는 이용자의 개인정보를 보호하기 위해 정보통신망 이용촉진 및 정보보호 등에 관한 법률 등 관련 법령이 정하는 바를 준수합니다.`,
        },
        {
          value: `운영자는 이용자의 개인정보를 보호하기 위해 개인정보처리방침을 제정, 공개하며, 이용자는 언제든지 이를 열람할 수 있습니다.`,
        },
      ],
    },
    {
      subTitle: "제7조 이용자의 의무",
      content: [
        {
          value: `이용자는 다음 행위를 하여서는 안 됩니다.`,
          children: [
            { value: `타인의 개인정보를 도용하는 행위` },
            { value: `운영자의 지적 재산권 등의 권리를 침해하는 행위` },
            { value: `법령 또는 공공질서 및 미풍양속에 위반되는 행위` },
          ],
        },
        {
          value: `이용자는 본 약관 및 관계 법령에서 규정한 사항을 준수하여야 합니다.`,
        },
      ],
    },
    {
      subTitle: "제8조 계약 해지 및 이용 제한",
      content: [
        {
          value: `이용자는 언제든지 본 서비스 내 회원 탈퇴 기능을 통해 이용 계약을 해지할 수 있습니다.`,
        },
        {
          value: `운영자는 이용자가 본 약관을 위반하거나 다음 각 호에 해당하는 경우 사전 통지 없이 이용 계약을 해지하거나 이용을 제한할 수 있습니다.`,
          children: [
            { value: `타인의 명예를 손상시키거나 불이익을 주는 행위` },
            { value: `공공질서 및 미풍양속에 반하는 행위` },
            { value: `본 서비스의 정상적인 운영을 방해하는 행위` },
          ],
        },
      ],
    },
    {
      subTitle: "제9조 책임의 한계",
      content: [
        {
          value: `운영자는 천재지변, 전쟁, 테러, 해킹, 시스템 장애 등 불가항력적인 사유로 인하여 본 서비스를 제공할 수 없는 경우 그에 대한 책임을 지지 않습니다.`,
        },
        {
          value: `운영자는 이용자의 귀책 사유로 인한 서비스 이용 장애에 대해 책임을 지지 않습니다.`,
        },
        {
          value: `본 서비스는 무료로 제공되며, 이에 따라 서비스 이용 장애 및 중단에 대한 금전적인 책임을 지지 않습니다.`,
        },
      ],
    },
    {
      subTitle: "제10조 준거법 및 재판관할",
      content: [
        {
          value: `본 약관에 명시되지 않은 사항에 대해서는 관계 법령 및 상관례에 따릅니다.`,
        },
        {
          value: `본 서비스 이용으로 발생한 분쟁에 대해 소송이 제기될 경우, 운영자의 소재지를 관할하는 법원을 전속 관할 법원으로 합니다.`,
        },
        { value: `본 약관은 2024년 8월 01일부터 적용됩니다.` },
      ],
    },
  ],
};

export const USER_PRIVACY = {
  title: "밀모리 개인정보 처리 방침",
};
